In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
train_df = pd.read_csv('train.csv')

# Display basic information about the dataset
print("Dataset Shape:", train_df.shape)
print("\nFirst 5 rows:")
display(train_df.head())

Dataset Shape: (31, 13)

First 5 rows:

,DATE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,1,265900,177570,889140,202833,******,915949,554372,128212,267803,115043,619722,506035
1,2,823141,737744,886529,161209,168524,235952,252192,377253,315068,******,133089,334811
2,3,358882,525224,750171,506256,970249,833495,236912,254528,848007,376453,507742,723784
3,4,107873,350822,506100,392107,904183,519665,194682,622939,298935,506852,281146,325526
4,5,177277,586971,959785,994936,499424,472138,501811,724506,649722,790019,770782,829065

In [17]:
train_df = train_df.replace('******', 0)
train_df = train_df.apply(pd.to_numeric)
train_df.head()

,DATE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,1,265900,177570,889140,202833,0,915949,554372,128212,267803,115043,619722,506035
1,2,823141,737744,886529,161209,168524,235952,252192,377253,315068,0,133089,334811
2,3,358882,525224,750171,506256,970249,833495,236912,254528,848007,376453,507742,723784
3,4,107873,350822,506100,392107,904183,519665,194682,622939,298935,506852,281146,325526
4,5,177277,586971,959785,994936,499424,472138,501811,724506,649722,790019,770782,829065

In [18]:
# Reshape the data from wide to long format
cleaned_df = train_df.melt(id_vars=['DATE'], 
                           var_name='MONTH', 
                           value_name='NUMBER')

# Create a proper date column using a safer method
def create_date(row):
    # Use the first day of each month with year 2024
    return pd.to_datetime(f"2024-{row['MONTH']}-{int(row['DATE'])}", errors='coerce')

cleaned_df['DATE'] = cleaned_df.apply(create_date, axis=1)

# Drop any rows with invalid dates (if any)
cleaned_df = cleaned_df.dropna(subset=['DATE'])

# Select only the relevant columns
cleaned_df = cleaned_df[['DATE', 'NUMBER']]

# Sort by date
cleaned_df = cleaned_df.sort_values('DATE').reset_index(drop=True)

In [27]:
cleaned_df.head(124)

          DATE  NUMBER
0   2024-01-01  265900
1   2024-01-02  823141
2   2024-01-03  358882
3   2024-01-04  107873
4   2024-01-05  177277
..         ...     ...
119 2024-04-29  479772
120 2024-04-30  720388
121 2024-05-01       0
122 2024-05-02  168524
123 2024-05-03  970249

[124 rows x 2 columns]